Tekla.Structures.ModelInternal.ConversionLink
Class representing link between reference model object and native part

Tekla.Structures.ModelInternal.ConversionLink.PartId
Linked part ID.

Tekla.Structures.ModelInternal.ConversionLink.RefModelId
Reference model ID.

Tekla.Structures.ModelInternal.ConversionLink.RefModelObjectId
Reference model object ID.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatus
Approval status for conversion.

Tekla.Structures.ModelInternal.ConversionLink.ConversionStatus
Conversion status.

Tekla.Structures.ModelInternal.ConversionLink.#ctor(System.Int32)
Creates a new conversion link instance.

Tekla.Structures.ModelInternal.ConversionLink.Insert
Inserts the conversion link instance in the model.
Returns: True on success.

Tekla.Structures.ModelInternal.ConversionLink.Select
Selects the conversion link instance from the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.ModelInternal.ConversionLink.Modify
Modifies the existing conversion link in the model database to match the current one.
Returns:

Tekla.Structures.ModelInternal.ConversionLink.Delete
Deletes the conversion link instance from the model. The identifier must be set.
Returns: True on success.